{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/christinasun/Library/CloudStorage/Dropbox/github_repos/belief_distortion/analysis/log_files/pilot/clean_pilot7.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Mar 2024, 21:44:06
{txt}
{com}. 
. graph drop _all
{txt}
{com}. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. /* set graphics off */
. set scheme s1color
{txt}
{com}. set seed 1984
{txt}
{com}. 
. import delimited $datadir/raw/pilot_7_import_ready.csv, varnames(1) clear
{res}{text}(75 vars, 503 obs)

{com}. 
. /* create vars for true red dots */
. gen a = 63 if matrix== "63_58" | matrix == "63_41"
{txt}(382 missing values generated)

{com}. replace a = 58 if matrix == "58_63"
{txt}(381 real changes made)

{com}. gen b = 58 if matrix == "63_58"
{txt}(452 missing values generated)

{com}. replace b = 41 if matrix == "63_41"
{txt}(70 real changes made)

{com}. replace b = 63 if matrix == "58_63"
{txt}(381 real changes made)

{com}. 
. gen pairid = 1 if matrix == "63_58"
{txt}(452 missing values generated)

{com}. replace pairid = 2 if matrix == "63_41"
{txt}(70 real changes made)

{com}. replace pairid = 3 if matrix == "58_63"
{txt}(381 real changes made)

{com}. 
. gen trueahigher = 1
{txt}
{com}. replace trueahigher = 0 if pairid == 3
{txt}(381 real changes made)

{com}. 
. gen setid = 1
{txt}
{com}. label var setid "matrix set"
{txt}
{com}. 
. // dummy for investing in portfolio A in treatment or thinking A higher in control
. gen gahigher = .
{txt}(503 missing values generated)

{com}. replace gahigher = 1 if (invest == "Portfolio A" & treat == 1) | (q16 == "Portfolio A" & treat==0)
{txt}(202 real changes made)

{com}. replace gahigher = 0 if (invest== "Portfolio B" & treat == 1) | (q16 == "Portfolio B" & treat==0)
{txt}(153 real changes made)

{com}. 
. gen investa = 1 if invest == "Portfolio A"
{txt}(259 missing values generated)

{com}. replace investa = 0 if invest == "Portfolio B"
{txt}(258 real changes made)

{com}. 
. // guess if matrix is 63 and 58
. gen guessa = q21_1 if matrix == "63_58" | matrix == "58_63"
{txt}(71 missing values generated)

{com}. replace guessa  = q28_1 if matrix == "63_41"
{txt}(70 real changes made)

{com}. 
. gen guessb = q21_2 if matrix == "63_58" | matrix == "58_63"
{txt}(71 missing values generated)

{com}. replace guessb = q28_2 if matrix == "63_41"
{txt}(70 real changes made)

{com}. 
. // delete survey preview and tests 
. drop if strpos(startdate, "3/2/24")!= 0
{txt}(2 observations deleted)

{com}. 
. gen dcguess = 0
{txt}
{com}. replace dcguess = 1 if trueahigher == gahigher 
{txt}(182 real changes made)

{com}. 
. label define treatlab 0 "Control" 1 "Treat"
{txt}
{com}. label values treat treatlab
{txt}
{com}. 
. 
. 
. 
. 
. 
. graph bar guessa guessb if pairid == 3,  over(gahigher) over(treat)
{res}{txt}
{com}. graph bar guessa guessb if pairid == 2, over(gahigher)
{res}{txt}
{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/christinasun/Library/CloudStorage/Dropbox/github_repos/belief_distortion/analysis/log_files/pilot/clean_pilot7.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Mar 2024, 21:44:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}